tap "siderolabs/tap"
tap "homebrew/cask-versions"
tap "int128/kubelogin"
tap "siderolabs/talos"
brew "ctags"
brew "ghi"
brew "git"
brew "hub"
brew "macvim"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "zsh"
brew "siderolabs/tap/talosctl"
cask "brave-browser"
cask "iterm2"

brew "arp-scan"
brew "python@3.12"
brew "glib"
brew "cloudflared"
brew "ffmpeg"
brew "git-crypt"
brew "go"
brew "gobject-introspection"
brew "librsvg"
brew "graphviz"
brew "helm"
brew "iperf3"
brew "ipmitool"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "libpq"
brew "llvm"
brew "nghttp2"
brew "nmap"
brew "node"
brew "ntp"
brew "parallel"
brew "telnet"
brew "watch"
brew "wget"
brew "yq"
brew "int128/kubelogin/kubelogin"
brew "siderolabs/tap/omnictl"
brew "siderolabs/tap/talosctl"
cask "appflowy"
cask "audacity"
cask "balenaetcher"
cask "bitwarden"
cask "cryptomator"
cask "darktable"
cask "db-browser-for-sqlite"
cask "drawio"
cask "google-cloud-sdk"
cask "keepingyouawake"
cask "lens"
cask "librecad"
cask "musescore"
cask "openrefine"
cask "postman"
cask "qbittorrent"
cask "qownnotes"
cask "signal"
cask "sublime-text"
cask "transmission"
cask "typora"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "xquartz"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "xaver.clang-format"
vscode "zxh404.vscode-proto3"
